const apiURLBase = 'https://tafsir.app/get_word.php?src=quran-roots&w=';

const keys = [
  {
    "num": "27",
    "words": [
      "فضو",
      "إرم",
      "زجو",
      "حفو",
      "رسو",
      "دنو",
      "لفو"
    ]
  },
  {
    "num": "0378",
    "words": [
      "فضض",
      "غضض",
      "جثث",
      "حثث",
      "قطط",
      "ذبب",
      "غمم",
      "رمم",
      "عرر",
      "لبب",
      "حطط",
      "ضلل",
      "حسس",
      "جرر",
      "حمم",
      "خلل",
      "عفف",
      "قرر",
      "بسس",
      "ذمم",
      "زفف",
      "سلل",
      "ذرر",
      "ثلل",
      "حفف",
      "حرر",
      "قضض",
      "طمم",
      "ربب",
      "بثث",
      "طفف",
      "جمم",
      "رسس",
      "خرر",
      "برهن",
      "بنن",
      "لذذ",
      "رقق",
      "رصص",
      "أما",
      "رجج",
      "فرر",
      "دلل",
      "صفف",
      "حجج",
      "كفف",
      "جبب",
      "ذلل",
      "قلل",
      "حبب",
      "حنن",
      "زلل",
      "ضمم",
      "تبب",
      "حقق",
      "كلل",
      "حلل",
      "كمم",
      "دعع",
      "شرر",
      "كرر",
      "لجج",
      "كبب",
      "لمم",
      "صرر",
      "شحح",
      "جنن",
      "فزز",
      "جدد",
      "نمم"
    ]
  },
  {
    "num": "023478",
    "words": [
      "فضح",
      "شيأ",
      "رمن",
      "أبل",
      "زيل",
      "جوس",
      "جور",
      "مهن",
      "بوأ",
      "بوب",
      "هلع",
      "قرش",
      "شأم",
      "أخر",
      "حصب",
      "بطأ",
      "بيد",
      "زبن",
      "دفأ",
      "بقع",
      "غوط",
      "هيل",
      "بأس",
      "أمل",
      "أمت",
      "غيث",
      "وطن",
      "صمت",
      "خبأ",
      "مزق",
      "ذأب",
      "ضجع",
      "قلع",
      "فصم",
      "جزأ",
      "مول",
      "همن",
      "زلم",
      "سفح",
      "أول",
      "أون",
      "ملق",
      "قوع",
      "زود",
      "زول",
      "صرخ",
      "حيق",
      "أرك",
      "خيم",
      "حوط",
      "تسع",
      "أنس",
      "رفق"
    ]
  },
  {
    "num": "34578",
    "words": [
      "يأس"
    ]
  },
  {
    "num": "2478",
    "words": [
      "قري",
      "بدو",
      "جفو",
      "عشو",
      "سمو",
      "أسو",
      "وهي",
      "سجو",
      "دعو",
      "وعي",
      "مطو"
    ]
  },
  {
    "num": "02345678",
    "words": [
      "جثم",
      "أبق",
      "درس",
      "درج",
      "بحر",
      "خنس",
      "برز",
      "برأ",
      "عدس",
      "ثوب",
      "دخل",
      "دخر",
      "جوع",
      "سرق",
      "فأد",
      "جرز",
      "خلف",
      "خلص",
      "زمر",
      "زمل",
      "بسم",
      "ذبح",
      "زهد",
      "زهق",
      "حصن",
      "حصد",
      "زفر",
      "سلف",
      "ذرأ",
      "بطش",
      "بطل",
      "حفر",
      "حفد",
      "حرك",
      "سقط",
      "ربص",
      "ربح",
      "سعد",
      "خسف",
      "خسأ",
      "خسر",
      "رتع",
      "بدن",
      "خطف",
      "بدأ",
      "جمح",
      "جمل",
      "أفك",
      "أفل",
      "بقل",
      "رسخ",
      "بحث",
      "خرج",
      "دحض",
      "رقم",
      "أمر",
      "سكن",
      "دون",
      "رجع",
      "رجل",
      "رجف",
      "أرض",
      "بلغ",
      "بلد",
      "خبت",
      "زرع",
      "أزف",
      "حضر",
      "سغب",
      "أهل",
      "أثل",
      "ثعب",
      "رأف",
      "خفت",
      "ثقف",
      "رهب",
      "جزع",
      "خمط",
      "خمص",
      "حنذ",
      "دأب",
      "زلق",
      "سفك",
      "سفع",
      "زحف",
      "سمد",
      "سبغ",
      "سبح",
      "سكب",
      "سكر",
      "سجر",
      "سجد",
      "لعب",
      "بجس",
      "ذهب",
      "ثبت",
      "حلف",
      "خزن",
      "حظر",
      "خضع",
      "بخع",
      "جلس",
      "شرح",
      "شرد",
      "شرب",
      "ردم",
      "ركز",
      "ركع",
      "رضع",
      "ركن",
      "ثخن",
      "لمح",
      "شحن",
      "جنح",
      "رغب",
      "دهن",
      "حدث",
      "أله",
      "قحم",
      "خضد",
      "رشد"
    ]
  },
  {
    "num": "0234578",
    "words": [
      "حرض",
      "أثر",
      "تين",
      "دسر",
      "سفر",
      "ثلث",
      "رمز",
      "رمض",
      "زرب",
      "دفع",
      "دفق",
      "أبد",
      "شوك",
      "أصل",
      "درك",
      "ترب",
      "ترك",
      "ترف",
      "وكز",
      "شنأ",
      "برص",
      "برج",
      "برح",
      "برد",
      "برق",
      "برك",
      "برم",
      "أجل",
      "ذكر",
      "حطم",
      "حطب",
      "ثور",
      "دخن",
      "جوز",
      "سرع",
      "توب",
      "سرب",
      "سرد",
      "سرح",
      "سرف",
      "حسم",
      "مهل",
      "حسر",
      "مهد",
      "حسب",
      "سطر",
      "بور",
      "جرم",
      "جرف",
      "جرع",
      "جرح",
      "جرد",
      "حمد",
      "حمر",
      "حمل",
      "خلق",
      "خلد",
      "خلع",
      "خلط",
      "بسط",
      "بسق",
      "بسل",
      "أجر",
      "خذل",
      "خنق",
      "شأن",
      "أخذ",
      "حصل",
      "سلح",
      "سلب",
      "ذرع",
      "بطر",
      "بطن",
      "زجر",
      "ذخر",
      "ضوأ",
      "حرف",
      "حرق",
      "حرم",
      "حرب",
      "حرث",
      "حرج",
      "حرس",
      "سقف",
      "حرص",
      "بيض",
      "بيع",
      "بيت",
      "رمح",
      "هنأ",
      "بصر",
      "شغل",
      "بصل",
      "جسم",
      "جسد",
      "حكم",
      "زبر",
      "زبد",
      "جعل",
      "ربط",
      "سمع",
      "حذر",
      "سبط",
      "سحل",
      "سحق",
      "سحر",
      "سحت",
      "سحب",
      "ذعن",
      "خطب",
      "بدر",
      "بدع",
      "شجر",
      "أصر",
      "جمع",
      "ليل",
      "أفق",
      "ختم",
      "ختر",
      "خرق",
      "خرص",
      "خرب",
      "رسل",
      "رقب",
      "رقد",
      "رصد",
      "جهد",
      "جهز",
      "جهر",
      "جهل",
      "ركب",
      "ثرب",
      "أمن",
      "صخر",
      "أمد",
      "وطأ",
      "يتم",
      "خيل",
      "خصم",
      "خصف",
      "دول",
      "شخص",
      "رجز",
      "رجس",
      "رجم",
      "سأل",
      "أكل",
      "بلس",
      "بلع",
      "خبل",
      "خبث",
      "خبط",
      "خبر",
      "خبز",
      "لقم",
      "أزر",
      "بغل",
      "بغت",
      "بغض",
      "رطب",
      "فوه",
      "فوم",
      "صلد",
      "حتم",
      "دبر",
      "تجر",
      "زعم",
      "ذأم",
      "حجب",
      "حجز",
      "حجر",
      "كيل",
      "صبغ",
      "قضب",
      "جبت",
      "جبر",
      "جبه",
      "جبن",
      "جبل",
      "رعد",
      "رعب",
      "ثمر",
      "ثمن",
      "دنر",
      "نون",
      "دحر",
      "روع",
      "رود",
      "رأس",
      "زنم",
      "دثر",
      "بذر",
      "أحد",
      "ذقن",
      "حبس",
      "حبر",
      "حبل",
      "حبك",
      "حبط",
      "ريب",
      "ريع",
      "ريش",
      "رين",
      "ثقل",
      "حلق",
      "رمد",
      "خمد",
      "خمس",
      "خمر",
      "زقم",
      "مور",
      "ذنب",
      "حشر",
      "ثقب",
      "شفق",
      "حنك",
      "بشر",
      "حنف",
      "جذع",
      "حنث",
      "زلف",
      "سفه",
      "سفن",
      "سفل",
      "تبر",
      "تبع",
      "بزغ",
      "سرج",
      "تفث",
      "سمر",
      "عنب",
      "سبع",
      "سبت",
      "سبق",
      "أسن",
      "بضع",
      "حقف",
      "حقب",
      "سكت",
      "ذود",
      "حزب",
      "ذوق",
      "حزن",
      "أسر",
      "دلك",
      "سجل",
      "سجن",
      "حسن",
      "لعن",
      "حسد",
      "ثبر",
      "صيد",
      "حلم",
      "بتل",
      "بتك",
      "بتر",
      "أيد",
      "ستر",
      "زور",
      "زوج",
      "تعس",
      "بكم",
      "بكر",
      "خضر",
      "بخس",
      "ضأن",
      "حين",
      "حيف",
      "حيد",
      "حيض",
      "حير",
      "جلب",
      "جلد",
      "رحق",
      "رحم",
      "رحب",
      "زيت",
      "زين",
      "ظلم",
      "شرق",
      "شرط",
      "شرع",
      "ردف",
      "سعر",
      "ذهل",
      "لهث",
      "لهب",
      "أرب",
      "ركس",
      "ركض",
      "ركد",
      "ركم",
      "خيط",
      "لمز",
      "لمس",
      "رذل",
      "خشع",
      "خشب",
      "شحم",
      "جنف",
      "حول",
      "حوت",
      "حوب",
      "حور",
      "جند",
      "جنب",
      "رهط",
      "رغم",
      "عسل",
      "رغد",
      "رهن",
      "رهق",
      "دهر",
      "دهم",
      "مرأ",
      "أسف",
      "بعث",
      "بعد",
      "بعر",
      "بعل",
      "جدل",
      "جدث",
      "جدر",
      "خول",
      "خون",
      "خوض",
      "دمغ",
      "دمع",
      "دمر",
      "رزق",
      "حدب",
      "حدق",
      "بهل",
      "بهم",
      "ألف",
      "بهج",
      "بهت",
      "خدع",
      "خدن",
      "جحد",
      "جحم",
      "رفع",
      "رفد",
      "رفث",
      "رفت"
    ]
  },
  {
    "num": "02378",
    "words": [
      "أثث",
      "دسس",
      "أبب",
      "برر",
      "أجج",
      "ضنن",
      "دكك",
      "شقق",
      "حمأ",
      "ضرر",
      "فظظ",
      "عمم",
      "زجج",
      "خطط",
      "طفأ",
      "نمرق",
      "أفف",
      "سدد",
      "بأر",
      "صكك",
      "أمم",
      "صخخ",
      "خصص",
      "أزز",
      "مدد",
      "عزز",
      "نوأ",
      "خفف",
      "أدد",
      "ضهأ",
      "حضض",
      "غصص",
      "غصب",
      "عضض",
      "جذذ",
      "تمم",
      "ضدد",
      "عدد",
      "كنن",
      "ثجج",
      "حظظ",
      "ردد",
      "شدد",
      "أسس",
      "قثأ",
      "ألل",
      "خدد"
    ]
  },
  {
    "num": "3478",
    "words": [
      "ثني",
      "طوي",
      "أبي",
      "جيد",
      "أتي",
      "لوت",
      "جبي",
      "مأي",
      "مني",
      "هدي",
      "ندي",
      "نهي",
      "خشي",
      "مشي"
    ]
  },
  {
    "num": "012345678",
    "words": [
      "عطف",
      "قطر",
      "قطف",
      "متع",
      "لبد",
      "لبس",
      "ورث",
      "لبن",
      "وقع",
      "عبث",
      "عبد",
      "عبر",
      "وبر",
      "نصب",
      "ضحك",
      "قمص",
      "عثر",
      "وصل",
      "فشل",
      "غفل",
      "عصم",
      "فتر",
      "فتح",
      "هلك",
      "وثق",
      "ضرب",
      "ولج",
      "قرب",
      "قرع",
      "بسر",
      "سلخ",
      "نخر",
      "سلك",
      "نبط",
      "كهن",
      "كظم",
      "طمع",
      "قعر",
      "نسف",
      "محص",
      "هضم",
      "نصر",
      "نبع",
      "نطق",
      "كذب",
      "لغب",
      "قبل",
      "فرش",
      "فرط",
      "فرع",
      "فرغ",
      "فرج",
      "فرق",
      "مزن",
      "فسد",
      "مدن",
      "فوض",
      "فوق",
      "مشج",
      "نعق",
      "لحق",
      "عزم",
      "كدر",
      "كدح",
      "ضبح",
      "وفد",
      "وفض",
      "قلد",
      "شمت",
      "شمخ",
      "غرق",
      "عقد",
      "شهق",
      "عدن",
      "قذف",
      "وكد",
      "وكل",
      "غطش",
      "فكه",
      "سمن",
      "صعد",
      "عند",
      "يوم",
      "غبر",
      "ظعن",
      "غلم",
      "غبن",
      "نثر",
      "كلأ",
      "وجه",
      "وهج",
      "وجد",
      "وجب",
      "نحر",
      "قوس",
      "نزف",
      "علن",
      "ضغث",
      "سهر",
      "صنع",
      "هطع",
      "نكف",
      "نكل",
      "نكص",
      "نكب",
      "نكد",
      "نشط",
      "نشأ",
      "سخر",
      "يقن",
      "نضد",
      "نضج",
      "طلع",
      "طلق",
      "هبط",
      "لطف",
      "كبر",
      "نغض",
      "نفق",
      "نفث",
      "نفخ",
      "نفد",
      "نفح",
      "مرح",
      "مرد",
      "طفق",
      "بعض"
    ]
  },
  {
    "num": "1247",
    "words": [
      "عطو",
      "عضو",
      "سهو"
    ]
  },
  {
    "num": "01357",
    "words": [
      "متى"
    ]
  },
  {
    "num": "78",
    "words": [
      "قلي",
      "سدي",
      "عري",
      "صلصل",
      "كفي",
      "رضو",
      "وصي",
      "صغو",
      "رفرف",
      "ثري",
      "قني",
      "كي",
      "غلي",
      "حصحص",
      "عزو",
      "عيي",
      "وفي",
      "سلو",
      "بلو",
      "شفو",
      "حمي",
      "جوو",
      "سعي",
      "معي",
      "سري",
      "أوي",
      "فري",
      "زحزح",
      "سنو",
      "زلزل",
      "خوي",
      "حلي",
      "طمأن",
      "عصي",
      "فتي",
      "أيي",
      "صلي",
      "صلو",
      "حوي",
      "عسي",
      "ضحو",
      "جثو"
    ]
  },
  {
    "num": "013457",
    "words": [
      "طوف"
    ]
  },
  {
    "num": "4578",
    "words": [
      "جلو",
      "جذو",
      "تلو",
      "ذرو",
      "بغي"
    ]
  },
  {
    "num": "03478",
    "words": [
      "تيه",
      "سوغ",
      "جوف",
      "مجس",
      "دور",
      "نوق",
      "موه",
      "صيح",
      "شطأ",
      "حيص",
      "زيد",
      "خيب",
      "حوج",
      "حوز",
      "خور",
      "ألت"
    ]
  },
  {
    "num": "67",
    "words": [
      "رقي",
      "إسماعيل",
      "إن",
      "هاء",
      "الذي",
      "بابل",
      "على",
      "جبريل"
    ]
  },
  {
    "num": "0124578",
    "words": [
      "طود",
      "شيد",
      "غور",
      "قتل",
      "قتر",
      "عتد",
      "ميل",
      "وبل",
      "كلب",
      "سهم",
      "قيل",
      "كسل",
      "صور",
      "نضر"
    ]
  },
  {
    "num": "17",
    "words": [
      "قارون",
      "سليمان",
      "يعقوب",
      "ثمود",
      "شعيب",
      "زكريا",
      "يوسف",
      "لقمان",
      "موسى",
      "اليسع",
      "أيوب",
      "عيسى",
      "لولا",
      "هارون",
      "عزير",
      "هامان",
      "يونس",
      "فرعون"
    ]
  },
  {
    "num": "0134578",
    "words": [
      "طوع",
      "شيع",
      "سود",
      "ضيز",
      "ضيف",
      "هلم",
      "هنا",
      "وزن",
      "لون",
      "يمن",
      "هيأ",
      "كور",
      "فوج",
      "عود",
      "نوح",
      "عيل",
      "نوص",
      "موج",
      "وتن",
      "شطن",
      "صرط",
      "صوب",
      "وتد"
    ]
  },
  {
    "num": "01234567",
    "words": [
      "عرج",
      "فره"
    ]
  },
  {
    "num": "278",
    "words": [
      "عرو",
      "ذكو",
      "سطو",
      "مكو",
      "زكو",
      "وقي",
      "رجو",
      "كلو",
      "صبو",
      "فردوس",
      "كسو",
      "حيي",
      "يدي",
      "ألو",
      "مرو"
    ]
  },
  {
    "num": "347",
    "words": [
      "نأي",
      "بني",
      "شفي"
    ]
  },
  {
    "num": "0123478",
    "words": [
      "سوق",
      "سيل",
      "سيح",
      "عيب",
      "هيج",
      "لقط",
      "كون",
      "صبع",
      "سير",
      "قوب",
      "نضخ"
    ]
  },
  {
    "num": "012478",
    "words": [
      "سوم"
    ]
  },
  {
    "num": "47",
    "words": [
      "سوي",
      "لحي",
      "غرو",
      "قوي",
      "ثبي"
    ]
  },
  {
    "num": "1234578",
    "words": [
      "سور",
      "نقم"
    ]
  },
  {
    "num": "0134678",
    "words": [
      "سوع"
    ]
  },
  {
    "num": "023578",
    "words": [
      "سوأ",
      "درأ",
      "شرذم",
      "نبز",
      "جسس",
      "سرمد",
      "رتق",
      "رتل",
      "ظمأ",
      "خطأ",
      "برزخ",
      "بقر",
      "قطمر",
      "هشش",
      "زرق",
      "سأم",
      "سردق",
      "شتت",
      "شكك",
      "جفأ",
      "خفض",
      "صيص",
      "فكك",
      "كأس",
      "ردأ",
      "لدد",
      "زخرف"
    ]
  },
  {
    "num": "0347",
    "words": [
      "سوح",
      "تور",
      "حوش"
    ]
  },
  {
    "num": "034578",
    "words": [
      "شوظ",
      "ترق",
      "جود",
      "جوب",
      "حصر",
      "بين",
      "لين",
      "سدس",
      "دوم",
      "جفن",
      "كيف",
      "روض",
      "روغ",
      "روح",
      "روم",
      "أوب",
      "سبل",
      "أنث",
      "أيم",
      "زيغ",
      "خير",
      "أنف",
      "خوف",
      "ألم"
    ]
  },
  {
    "num": "037",
    "words": [
      "درر",
      "دبب",
      "كفأ",
      "زمهر",
      "غلل",
      "صفا",
      "ستت",
      "جلل",
      "ألا"
    ]
  },
  {
    "num": "478",
    "words": [
      "طحو",
      "لقي",
      "ثوي",
      "جري",
      "أخو",
      "نسي",
      "رخو",
      "غوي",
      "فدي",
      "هوي",
      "شوي",
      "غني",
      "قضي",
      "كدي",
      "دحو",
      "خفي",
      "أدي",
      "جزي",
      "غطو",
      "شتو",
      "لهو",
      "خلو",
      "قدو",
      "جني",
      "مري"
    ]
  },
  {
    "num": "7",
    "words": [
      "إنجيل",
      "دسو",
      "إلياس",
      "كبكب",
      "يقطين",
      "إبراهيم",
      "هدهد",
      "نسو",
      "إبليس",
      "مكة",
      "نصي",
      "اللات",
      "هاروت",
      "حنين",
      "سينين",
      "أيكة",
      "أمو",
      "إستبرق",
      "دمو",
      "مهما",
      "مأجوج",
      "جالوت",
      "يأجوج",
      "صفصف",
      "إما",
      "عثو",
      "كأين",
      "عمران",
      "غشو",
      "مسو",
      "ماروت",
      "زني",
      "ياقوت",
      "وني",
      "هنالك",
      "ميكال",
      "إدريس",
      "سلسبيل",
      "سيناء",
      "يثرب",
      "طرو",
      "آزر",
      "لاكن",
      "إسحاق",
      "ماذا",
      "يعوق",
      "إسرائيل",
      "يغوث",
      "تنور",
      "ذبذب",
      "صرصر",
      "دهي",
      "بكة"
    ]
  },
  {
    "num": "0123457",
    "words": [
      "قسر",
      "ضعف"
    ]
  },
  {
    "num": "03578",
    "words": [
      "قسس",
      "قصص",
      "سرر",
      "هلل",
      "هدد",
      "سنن",
      "فنن",
      "صمم",
      "هزز",
      "صبب",
      "غرر",
      "سمم",
      "سبب",
      "ملل",
      "شطط",
      "سخط",
      "ظلل",
      "طلل",
      "همم",
      "صدد",
      "مرر",
      "مسس",
      "لفف",
      "فجج"
    ]
  },
  {
    "num": "12578",
    "words": [
      "قسو"
    ]
  },
  {
    "num": "013478",
    "words": [
      "صوع",
      "هون",
      "هور"
    ]
  },
  {
    "num": "4678",
    "words": [
      "أبو",
      "لوي"
    ]
  },
  {
    "num": "237",
    "words": [
      "زنجبيل",
      "سنبل",
      "كوكب",
      "سندس",
      "قنطر",
      "أنم"
    ]
  },
  {
    "num": "02347",
    "words": [
      "جيأ",
      "بول",
      "زهر",
      "سند",
      "كود",
      "أدم",
      "قدح"
    ]
  },
  {
    "num": "2345678",
    "words": [
      "تحت"
    ]
  },
  {
    "num": "124578",
    "words": [
      "عتو",
      "صفو",
      "نجو"
    ]
  },
  {
    "num": "1278",
    "words": [
      "قصو",
      "قفو",
      "غلو"
    ]
  },
  {
    "num": "01235678",
    "words": [
      "بعثر",
      "عبقر",
      "وضن",
      "وجف"
    ]
  },
  {
    "num": "178",
    "words": [
      "عصو",
      "غثو",
      "عنو"
    ]
  },
  {
    "num": "02357",
    "words": [
      "جهنم",
      "ثبط",
      "عرجن"
    ]
  },
  {
    "num": "014578",
    "words": [
      "ضيع",
      "شطر"
    ]
  },
  {
    "num": "134578",
    "words": [
      "ضير"
    ]
  },
  {
    "num": "378",
    "words": [
      "زري",
      "رمي",
      "لظي",
      "ودي",
      "وري",
      "دري",
      "مضي",
      "كوي",
      "وشي",
      "رعي",
      "رأي",
      "سقي",
      "ردي",
      "صدي",
      "أني"
    ]
  },
  {
    "num": "23478",
    "words": [
      "تقن",
      "نقع"
    ]
  },
  {
    "num": "578",
    "words": [
      "عسعس",
      "خطو",
      "دمدم",
      "إي",
      "بكي"
    ]
  },
  {
    "num": "12478",
    "words": [
      "شقو",
      "عفو",
      "غدو",
      "لغو",
      "غزو",
      "عدو",
      "ملو",
      "شكو",
      "هبو",
      "فجو"
    ]
  },
  {
    "num": "01345678",
    "words": [
      "قفل",
      "لوط",
      "يبس",
      "هيت",
      "عوج",
      "قنط",
      "وبق"
    ]
  },
  {
    "num": "37",
    "words": [
      "شري",
      "ثيب",
      "حصي",
      "نوي",
      "عنكب",
      "سلسل",
      "كأن",
      "فأي",
      "حري",
      "إلا"
    ]
  },
  {
    "num": "24578",
    "words": [
      "ولي",
      "صنو",
      "رهو"
    ]
  },
  {
    "num": "0123578",
    "words": [
      "قرأ",
      "قرطس",
      "فيأ",
      "لقف",
      "غلظ",
      "عوق",
      "عون",
      "عوم",
      "وكأ",
      "منن",
      "وجل",
      "سربل",
      "قيض"
    ]
  },
  {
    "num": "0237",
    "words": [
      "قسطس",
      "خرطم",
      "ضفدع",
      "شفه"
    ]
  },
  {
    "num": "078",
    "words": [
      "تلل"
    ]
  },
  {
    "num": "34678",
    "words": [
      "عمي"
    ]
  },
  {
    "num": "2378",
    "words": [
      "وحي",
      "خنزر",
      "حدد",
      "ظنن",
      "نفي"
    ]
  },
  {
    "num": "678",
    "words": [
      "خزي"
    ]
  },
  {
    "num": "024578",
    "words": [
      "حفظ",
      "غير",
      "أثم",
      "شكر",
      "سطح",
      "صير",
      "رحل",
      "لهم",
      "دين",
      "حوذ"
    ]
  },
  {
    "num": "023457",
    "words": [
      "حرد",
      "سقم",
      "سقر"
    ]
  },
  {
    "num": "1578",
    "words": [
      "لؤلؤ",
      "ربو",
      "قنو"
    ]
  },
  {
    "num": "0234678",
    "words": [
      "أود",
      "جمد",
      "كنس",
      "كلح",
      "هزأ",
      "لجأ",
      "مخض"
    ]
  },
  {
    "num": "123578",
    "words": [
      "ملأ"
    ]
  },
  {
    "num": "567",
    "words": [
      "هات"
    ]
  },
  {
    "num": "01257",
    "words": [
      "لظى"
    ]
  },
  {
    "num": "57",
    "words": [
      "أيان",
      "تابوت",
      "بلى",
      "توراة",
      "هيهات"
    ]
  },
  {
    "num": "012357",
    "words": [
      "نسأ",
      "قشعر",
      "قمطر"
    ]
  },
  {
    "num": "14578",
    "words": [
      "محو",
      "لو",
      "بل"
    ]
  },
  {
    "num": "23578",
    "words": [
      "ودد"
    ]
  },
  {
    "num": "145678",
    "words": [
      "مع"
    ]
  },
  {
    "num": "0345678",
    "words": [
      "بدل",
      "ليت",
      "أشر",
      "أوه",
      "حيث",
      "دهق"
    ]
  },
  {
    "num": "023678",
    "words": [
      "ليس",
      "أمس",
      "خردل",
      "صبأ"
    ]
  },
  {
    "num": "345678",
    "words": [
      "بقي",
      "أذي",
      "جيب"
    ]
  },
  {
    "num": "3467",
    "words": [
      "فني"
    ]
  },
  {
    "num": "0278",
    "words": [
      "يمم",
      "فتأ"
    ]
  },
  {
    "num": "0245678",
    "words": [
      "عين",
      "شعر"
    ]
  },
  {
    "num": "01234678",
    "words": [
      "وأد",
      "هرب",
      "نصت"
    ]
  },
  {
    "num": "034678",
    "words": [
      "وأل"
    ]
  },
  {
    "num": "2357",
    "words": [
      "حنجر"
    ]
  },
  {
    "num": "367",
    "words": [
      "طغي"
    ]
  },
  {
    "num": "01457",
    "words": [
      "ثم"
    ]
  },
  {
    "num": "2578",
    "words": [
      "خبو"
    ]
  },
  {
    "num": "012567",
    "words": [
      "لدى"
    ]
  },
  {
    "num": "014567",
    "words": [
      "كم",
      "لم"
    ]
  },
  {
    "num": "02578",
    "words": [
      "دلو",
      "ندد",
      "قدد"
    ]
  },
  {
    "num": "013578",
    "words": [
      "نيل",
      "عول",
      "ويل"
    ]
  },
  {
    "num": "0234567",
    "words": [
      "غوث",
      "أذن"
    ]
  },
  {
    "num": "0235678",
    "words": [
      "شكس",
      "سبأ",
      "درهم",
      "ينع",
      "جأر"
    ]
  },
  {
    "num": "167",
    "words": [
      "طالوت"
    ]
  },
  {
    "num": "013467",
    "words": [
      "لن"
    ]
  },
  {
    "num": "0135678",
    "words": [
      "لا",
      "لعل"
    ]
  },
  {
    "num": "157",
    "words": [
      "حتى",
      "مريم",
      "داود"
    ]
  },
  {
    "num": "0147",
    "words": [
      "قد"
    ]
  },
  {
    "num": "01347",
    "words": [
      "كين"
    ]
  },
  {
    "num": "45678",
    "words": [
      "أم"
    ]
  },
  {
    "num": "035678",
    "words": [
      "ما"
    ]
  },
  {
    "num": "01578",
    "words": [
      "وسوس"
    ]
  },
  {
    "num": "01378",
    "words": [
      "شمز"
    ]
  },
  {
    "num": "067",
    "words": [
      "في"
    ]
  },
  {
    "num": "0137",
    "words": [
      "ذا"
    ]
  },
  {
    "num": "1567",
    "words": [
      "ذو"
    ]
  },
  {
    "num": "1478",
    "words": [
      "شهو"
    ]
  },
  {
    "num": "0357",
    "words": [
      "إذا"
    ]
  },
  {
    "num": "0247",
    "words": [
      "ذيع"
    ]
  },
  {
    "num": "457",
    "words": [
      "رب"
    ]
  },
  {
    "num": "013567",
    "words": [
      "كلا"
    ]
  },
  {
    "num": "14678",
    "words": [
      "هل",
      "علو"
    ]
  },
  {
    "num": "01467",
    "words": [
      "أو"
    ]
  },
  {
    "num": "1467",
    "words": [
      "أن",
      "من"
    ]
  },
  {
    "num": "5678",
    "words": [
      "وي"
    ]
  },
  {
    "num": "234578",
    "words": [
      "أين",
      "بخل"
    ]
  },
  {
    "num": "12345678",
    "words": [
      "ندم"
    ]
  },
  {
    "num": "023467",
    "words": [
      "كسد"
    ]
  },
  {
    "num": "057",
    "words": [
      "إيا"
    ]
  },
  {
    "num": "123457",
    "words": [
      "صنم"
    ]
  },
  {
    "num": "012378",
    "words": [
      "يقظ"
    ]
  },
  {
    "num": "0678",
    "words": [
      "إذ"
    ]
  },
  {
    "num": "01245678",
    "words": [
      "مصر"
    ]
  },
  {
    "num": "13467",
    "words": [
      "لما"
    ]
  },
  {
    "num": "3578",
    "words": [
      "إلى"
    ]
  },
  {
    "num": "0134567",
    "words": [
      "أنى"
    ]
  },
  {
    "num": "14567",
    "words": [
      "عن"
    ]
  },
    {
    "num": "01234578",
    "words": [
      "فضل",
      "غضب",
      "عطل",
      "متن",
      "طول",
      "طوق",
      "طور",
      "شيب",
      "شيخ",
      "قطع",
      "وسط",
      "وسع",
      "وسق",
      "وسن",
      "وسل",
      "وسم",
      "عقم",
      "غمز",
      "غمر",
      "غمض",
      "مجد",
      "عرب",
      "عرش",
      "عرض",
      "عرم",
      "عرف",
      "سوف",
      "سول",
      "شور",
      "شهر",
      "لبث",
      "ورق",
      "ورد",
      "وقف",
      "وقد",
      "وقب",
      "وقت",
      "وقر",
      "وقذ",
      "عبأ",
      "قسط",
      "عبس",
      "وطر",
      "قسم",
      "غزل",
      "صوف",
      "قمل",
      "قمح",
      "قمع",
      "قمر",
      "عكف",
      "ضنك",
      "كفل",
      "كفر",
      "كفت",
      "عتب",
      "قصر",
      "وصب",
      "قصد",
      "عتق",
      "عتل",
      "قصف",
      "قصم",
      "غفر",
      "عصر",
      "عصب",
      "عصف",
      "سيب",
      "قهر",
      "طيب",
      "نتق",
      "ضيق",
      "كمل",
      "عجز",
      "عجب",
      "عجل",
      "عجم",
      "عجف",
      "وثن",
      "ضرع",
      "عفر",
      "غدق",
      "غدر",
      "ولد",
      "قرد",
      "قرح",
      "قرض",
      "قرن",
      "قرف",
      "نخل",
      "عمر",
      "سلق",
      "مكن",
      "سلط",
      "عمد",
      "عمق",
      "مكث",
      "عمل",
      "عمه",
      "سلم",
      "مكر",
      "وحش",
      "وحد",
      "طرق",
      "طرف",
      "طرد",
      "طرح",
      "صغر",
      "عهد",
      "عهن",
      "نبت",
      "نبذ",
      "كهف",
      "كهل",
      "شغف",
      "طمث",
      "طمس",
      "ربع",
      "لوح",
      "لوذ",
      "لوم",
      "سوط",
      "ظفر",
      "قعد",
      "نسك",
      "نسل",
      "نسب",
      "نسخ",
      "نسر",
      "هدم",
      "نجم",
      "نجس",
      "نجد",
      "سنه",
      "سنم",
      "شوب",
      "ودع",
      "ودق",
      "فقد",
      "فقر",
      "فقع",
      "فقه",
      "طعن",
      "طعم",
      "فلح",
      "فلن",
      "فلق",
      "فلك",
      "طفل",
      "نصف",
      "نصح",
      "صهر",
      "فند",
      "نبأ",
      "هشم",
      "نقر",
      "نقذ",
      "نقض",
      "نقص",
      "نقب",
      "نطف",
      "نطح",
      "طهر",
      "سدر",
      "نوب",
      "غيض",
      "هيم",
      "فحش",
      "غول",
      "كثب",
      "كثر",
      "مضغ",
      "كشف",
      "كشط",
      "غيظ",
      "هود",
      "ظهر",
      "عظم",
      "فيض",
      "فيل",
      "صمد",
      "صمع",
      "لقب",
      "لقح",
      "كوب",
      "غيب",
      "لدن",
      "وذر",
      "قبح",
      "قبر",
      "قبس",
      "قبض",
      "غوص",
      "غلب",
      "فرض",
      "فرح",
      "فرد",
      "فرث",
      "فرت",
      "غلف",
      "غلق",
      "مزج",
      "كلم",
      "فسر",
      "فسح",
      "فسق",
      "غنم",
      "فوت",
      "فوز",
      "شبه",
      "هزل",
      "هزم",
      "نعج",
      "نعس",
      "نعل",
      "لحف",
      "لحم",
      "لحن",
      "لحد",
      "صفر",
      "صفح",
      "عوذ",
      "عور",
      "قنت",
      "قنع",
      "فطر",
      "مثل",
      "عذر",
      "عذب",
      "كيد",
      "وزع",
      "صبح",
      "وزر",
      "صبر",
      "عزل",
      "محل",
      "محن",
      "محق",
      "عزب",
      "عزر",
      "نوم",
      "عير",
      "عيش",
      "نوش",
      "نور",
      "وصد",
      "وصف",
      "ميد",
      "مير",
      "ميز",
      "وفر",
      "وفق",
      "وضع",
      "طبع",
      "طبق",
      "عشر",
      "قلب",
      "قلم",
      "شمل",
      "شمس",
      "فصح",
      "نفس",
      "فصل",
      "عضل",
      "عضد",
      "شعب",
      "غرب",
      "غرم",
      "غرف",
      "شعل",
      "كعب",
      "موت",
      "همس",
      "همر",
      "همد",
      "شفع",
      "وتر",
      "عقر",
      "عقب",
      "ضمر",
      "عقل",
      "شهب",
      "شهد",
      "عدل",
      "ضغن",
      "طين",
      "غسل",
      "غسق",
      "فعل",
      "فكر",
      "طير",
      "صعر",
      "عنق",
      "سمك",
      "عنت",
      "صعق",
      "ملح",
      "ملك",
      "كند",
      "كنز",
      "منع",
      "شكل",
      "كلف",
      "وهب",
      "وهن",
      "وجس",
      "نحس",
      "نحت",
      "نحب",
      "نحل",
      "نذر",
      "صيف",
      "قوت",
      "كمه",
      "قوم",
      "قول",
      "يسر",
      "نزغ",
      "نزع",
      "نزل",
      "هجد",
      "هجع",
      "هجر",
      "لزم",
      "علم",
      "سهل",
      "كسب",
      "كسف",
      "صرف",
      "صرم",
      "وعد",
      "وعظ",
      "صرح",
      "علق",
      "نكر",
      "نكس",
      "نكث",
      "نكح",
      "نشر",
      "نشز",
      "معز",
      "صوت",
      "صوم",
      "مقت",
      "فتق",
      "فتل",
      "فتن",
      "شرك",
      "فهم",
      "مسد",
      "طلح",
      "كرب",
      "كرس",
      "لزب",
      "كره",
      "كرم",
      "نهر",
      "نهج",
      "همز",
      "نظر",
      "صحف",
      "صحب",
      "فخر",
      "كبت",
      "كبد",
      "مطر",
      "فور",
      "صدق",
      "صدف",
      "صلب",
      "قدم",
      "صلح",
      "قدر",
      "قدس",
      "صدر",
      "صدع",
      "صرع",
      "هرع",
      "نفل",
      "نفع",
      "نفذ",
      "نفر",
      "نفش",
      "مخر",
      "عسر",
      "مرض",
      "مرج",
      "فزع",
      "نعم",
      "لسن",
      "كتب",
      "كتم",
      "مسخ",
      "مسح",
      "نمل",
      "مسك",
      "صفن",
      "لفح",
      "لفت",
      "لفظ",
      "طلب",
      "فجر",
      "صفد"
    ]
  }
];

let allRootsWord = [];
let failedRootcall = [];
async function start() {
  // 0- 59
  for (let i = 0; i < 60; i++) {
    //27 total is 7 and 2478 total is 11
    console.log('Finished processing root key:', keys[i]);
    await getProcessedData(keys[i].words, keys[i].num);
    allRootsWord = [];

  }
  await saveObjTofile(failedRootcall, './resultData/failedRootCalls.json');
}

start();

async function getProcessedData(rootWords, rootKey) {

  for (let i = 0; i < rootWords.length; i++) { //rootWords.length
    //console.log('Processing root word:', rootWords[i], '(', i + 1, 'of', rootWords.length, ')');
    try {
      const apiUrl = apiURLBase + encodeURIComponent(rootWords[i]);
      await delay(3000); // Delay of 1 second between requests
      const response = await fetch(apiUrl);
      const responseData = await response.json();
      if (response.status == 200) {
        //console.log('responseData for root', rootWords[i], ':', JSON.stringify(responseData).substring(0, 30) + '...'); // Log first 100 characters
        let resultObj = await getDatafromHtml(responseData.data, rootWords[i]);
        allRootsWord.push(resultObj);
      }
    }
    catch (err) {
      
      failedRootcall.push({'num': rootKey, 'word': rootWords[i]});
      console.log(`Error fetching data for num: ${rootKey}, word: ${rootWords[i]}`);
      continue; // Skip to the next root word
    }

  }

  await saveObjTofile(allRootsWord, './resultData/' + rootKey + '.json');

  console.log('Total object:', allRootsWord.length);
  allRootsWord = [];
  allRootsWord.length = 0;

  console.log('------------------------------------------------------------');

}




async function getDatafromHtml(htmlData, rootWord = '') {

  let rootObject =
  {
    root: '', details: []
  };

  rootObject.root = rootWord;

  const jsdom = require("jsdom");
  const dom = new jsdom.JSDOM(htmlData);

  const h3Elements = dom.window.document.querySelectorAll("h3");
  h3Elements.forEach(element => {
    rootObject.details.push({ type: element.textContent.trim(), locs: [] });
  });

  const allTables = dom.window.document.querySelectorAll("table"); //const allTables = document.querySelectorAll('table');

  let mainCounter = 0;
  allTables.forEach(table => {
    const tableRows = table.querySelectorAll('tr');


    tableRows.forEach(row => {
      const firstTd = row.querySelector('td:first-child');
      const secondTd = row.querySelector('td:nth-child(2)');


      // let firstTdValue = firstTd ? firstTd.textContent.trim() : null;

      let firstTdValue = null;
      if (firstTd && (bId = firstTd.querySelector('b'))) {
        firstTdValue = bId.textContent.trim();
      }

      let secondTdValue = secondTd ? secondTd.textContent.trim() : null;

      if (firstTdValue && secondTdValue) {
        rootObject.details[mainCounter].locs.push({
          w: firstTdValue,
          l: convertArabicNumbersToEnglish(secondTdValue).replace(/\u00A0/g, " ").replace(/\s/g, '')
        });
      }

    });
    mainCounter++;

  });
  return rootObject;
}

function convertArabicNumbersToEnglish(text) {
  const arabicToEnglishMap = {
    '٠': '0',
    '١': '1',
    '٢': '2',
    '٣': '3',
    '٤': '4',
    '٥': '5',
    '٦': '6',
    '٧': '7',
    '٨': '8',
    '٩': '9'
  };
  return text.replace(/[٠-٩]/g, match => arabicToEnglishMap[match]);
}

//saveObjTofile(rootArray, 'output.json');
async function saveObjTofile(obj, filename) {
  const fs = require('fs');
  fs.writeFileSync(filename, JSON.stringify(obj, null, 2));
}

function delay(ms) {
  return new Promise(resolve => setTimeout(resolve, ms));
}